/***********************************************************************

                               Virtuality

                       Copyright by MiST land 2000

   --------------------------------------------------------------------
    Description:
   --------------------------------------------------------------------
    Author: Pavel A.Duvanov (Naughty)

************************************************************************/
//#include <dinput.h>
#include "Precomp.h"
#include "globals.h"

CLog logFile;	//	объект, предназначенный для создания лог-файлов

//	виртуальные размеры экрана
const float VirtualResX = 1024;	
const float VirtualResY = 768;	

