#include "Precomp.h"

//	Этот файл служит для хранения информации о текущей версии сейва
unsigned g_SaveVersion = 4;

/******************************************************************
Версия 4				14 марта 2002

  - Исправил ошибку: забыл сделать сохранение энциклопедии сил ForceHandbook
    
******************************************************************/

/******************************************************************
Версия 3				12 марта 2002

  - переделано сохранение механизма порождения скриптовых сцен
    (интерфейс SSceneMgr)
    
******************************************************************/

/******************************************************************
Версия 2				11 марта 2002

  - сделано сохранение FastAccessStrategy для персонажей. 
  
******************************************************************/

/******************************************************************
Версия 1				06 марта 2002

  - В менеджер скриптовых сцен добавленно событие E_QUESTFINISH и
    соответсвенно код его обрабатывающий.

******************************************************************/
